jimmywong2003/SSD1306-LCD-on-NRF52/ble_app_uart_adafruit_gfx_nrfx_twim/main.c
void testdrawcircle(void) {
        Adafruit_GFX_setRotation(0);
        for (int16_t i=0; i< Adafruit_GFX_height()/2; i+=2)
        {
                Adafruit_GFX_drawCircle(Adafruit_GFX_width()/2, Adafruit_GFX_height()/2, i, WHITE);
                SSD1306_display();
                nrf_delay_ms(200);
        }
}

void testdrawText(void)
{
        Adafruit_GFX_setCursor(0,0);
        Adafruit_GFX_setTextSize(1);
        Adafruit_GFX_setTextColor(WHITE, WHITE);
        Adafruit_GFX_setRotation(2);
        Adafruit_GFX_write('H');
        Adafruit_GFX_write('e');
        Adafruit_GFX_write('l');
        Adafruit_GFX_write('l');
        Adafruit_GFX_write('o');
        SSD1306_display();

}


/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;
        uint32_t count = 0;

        // Initialize.
        uart_init();
        log_init();
        timers_init();
        buttons_leds_init(&erase_bonds);
        power_management_init();
        ble_stack_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        printf("\r\nUART started.\r\n");
        NRF_LOG_INFO("Debug logging for UART over RTT started.");
        advertising_start();

        nrf_gpio_cfg_output(SSD1306_CONFIG_VDD_PIN);

        nrf_gpio_cfg(
                SSD1306_CONFIG_VDD_PIN,
                NRF_GPIO_PIN_DIR_OUTPUT,
                NRF_GPIO_PIN_INPUT_DISCONNECT,
                NRF_GPIO_PIN_NOPULL,
                NRF_GPIO_PIN_H0S1,
                NRF_GPIO_PIN_NOSENSE);

        nrf_gpio_pin_set(SSD1306_CONFIG_VDD_PIN);

        nrf_delay_ms(1000);

        // twi_init();

        twim_master_init(26, 27);

        SSD1306_begin(SSD1306_SWITCHCAPVCC, SSD1306_I2C_ADDRESS, false);
        Adafruit_GFX_init(SSD1306_LCDWIDTH, SSD1306_LCDHEIGHT, SSD1306_drawPixel);

        SSD1306_clearDisplay();
        Adafruit_GFX_drawBitmap(0, 0,  el_logo, 128, 32, 1);
        SSD1306_display();
        nrf_delay_ms(1000);


//         ssd1306_init_i2c(SSD1306_CONFIG_SCL_PIN, SSD1306_CONFIG_SDA_PIN);
//         ssd1306_begin(SSD1306_SWITCHCAPVCC, SSD1306_I2C_ADDRESS, false);
//
//         nrf_delay_ms(1000);
//
//         NRF_LOG_INFO("--- START ---");
//
//         nrf_delay_ms(1000);
//         ssd1306_display();
//         nrf_delay_ms(DELAY_MS);
//
//         NRF_LOG_INFO("--- testdrawline ---");
// //
//                 ssd1306_draw_circle(SSD1306_LCDWIDTH / 2, SSD1306_LCDHEIGHT / 2, 30, WHITE);
//                 ssd1306_display();


        // Enter main loop.
        for (;;)
        {
                // ssd1306_clear_display();
                // // draw a single pixel
                // ssd1306_draw_pixel(10, 10, WHITE);
                // ssd1306_display();
                // nrf_delay_ms(DELAY_MS);
                //
                // ssd1306_draw_circle(SSD1306_LCDWIDTH / 2, SSD1306_LCDHEIGHT / 2, 30, WHITE);
                // ssd1306_display();
                // nrf_delay_ms(DELAY_MS);
                //
                // testdrawchar();
                // nrf_delay_ms(DELAY_MS);
                //
                // ssd1306_clear_display();
                // ssd1306_display();
                // nrf_delay_ms(DELAY_MS);
                //
                // testdrawline();
                //
                // ssd1306_clear_display();
                // ssd1306_draw_bitmap(30, 16,  logo16_glcd_bmp, 16, 16, 1);
                // ssd1306_display();
                // nrf_delay_ms(DELAY_MS);
                //
                // // draw a bitmap icon and 'animate' movement
                // testdrawbitmap(logo16_glcd_bmp, LOGO16_GLCD_HEIGHT, LOGO16_GLCD_WIDTH);

                SSD1306_clearDisplay();
                SSD1306_display();

                testdrawcircle();
                nrf_delay_ms(1000);
                testdrawText();
                nrf_delay_ms(1000);

                SSD1306_clearDisplay();
                Adafruit_GFX_drawBitmap(0, 0,  el_logo, 128, 32, 1);
                SSD1306_display();
                nrf_delay_ms(1000);


                NRF_LOG_INFO("Count = %04d", count++);
                idle_state_handle();
        }
}


/**
 * @}
 */
